# SetCellStyle Method (TableCellStyle) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..SetCellStyle Method (TableCellStyle)
TableSectionData Class See Also
---
Sets a section's style
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetCellStyle(
	TableCellStyle Style
)
```

Visual Basic
---
```text
Public Sub SetCellStyle ( _
	Style As TableCellStyle _
)
```

Visual C++
---
```text
public:
void SetCellStyle(
	TableCellStyle^ Style
)
```

# ### Parameters
Style
    Type: Autodesk.Revit.DB..::..TableCellStyle
# Remarks
For standard schedule, must set the TableCellStyleOverrideOptions in the TableCellStyle to override this section.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
TableSectionData Class
SetCellStyle Overload
Autodesk.Revit.DB Namespace